#!/bin/bash
####################################################################################################
#   проверяем  активность концентраторов
#   $1 = пул адресов   концентраторов доступных по gprs
################################################################################################################################################################################
DIR=/home/nagios/
############################################################################
if [[ -z "$1" ]]
then
        echo "Missing parameters! Syntax: ./`basename $0` <ip address pool>"
        exit 3
else

  ip=$1
  pool=$1
  if [[ $ip =~ ^[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}$ ]]; then
    OIFS=$IFS
    IFS='.'
     
    ip=($ip)
    IFS=$OIFS
    [[ ${ip[0]} -le 255 && ${ip[1]} -le 255 \
      && ${ip[2]} -le 255 && ${ip[3]} -le 255 ]]
  else
    echo "неверно заданный IP адрес"
    exit 2
  fi

fi
#########################################################################
echo $pool
F=$DIR$FILE
/usr/bin/nmap  -n -sP $pool/21
