#!/bin/bash
#####################################################################################
#  автор Ринат Фахрутдинов 
#  скрипт последовательно запуска генератора таблиц для вебки с мониторингом активных клиентов
#
#####################################################################################

/home/nagios/convert2html.sh MSK MTS msk       #   MTS на московской

/home/nagios/convert2html.sh MSK MEGAFON msk   #   MEGAFON  на московской

/home/nagios/convert2html.sh MSK BEELINE msk   #   BEELINE   на московской
